### Terraform plan 
<details><summary>Click to see the plan</summary>


```diff

[command]/home/runner/work/_temp/18ef0b96-629a-4d94-ba90-a381e5980b80/terraform-bin show -no-color plan.tmp

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks_managed_node_group["bottlerocket_default"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
      + arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_default-20240502195756946700000001/14c79d71-46ca-2968-b10b-f35f6146cfe1"
        id                     = "aws-eks-cluster:bottlerocket_default-20240502195756946700000001"
      + resources              = [
          + {
              + autoscaling_groups              = [
                  + {
                      + name = "eks-bottlerocket_default-20240502195756946700000001-14c79d71-46ca-2968-b10b-f35f6146cfe1"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ]
      + status                 = "CREATE_FAILED"
        tags                   = {
            "Name" = "bottlerocket_default"
        }
        # (7 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.aws-auth.kubernetes_config_map_v1_data.aws_auth[0] will be created
  + resource "kubernetes_config_map_v1_data" "aws_auth" {
      + data          = {
          + "mapAccounts" = <<-EOT
                - "322620855520"
            EOT
          + "mapRoles"    = jsonencode([])
          + "mapUsers"    = <<-EOT
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::322620855520:user/caio"
                  "username": "caio"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::322620855520:root"
                  "username": "root"
            EOT
        }
      + field_manager = "Terraform"
      + force         = true
      + id            = (known after apply)

      + metadata {
          + name      = "aws-auth"
          + namespace = "kube-system"
        }
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.10.1-eksbuild.7"
      + arn                         = (known after apply)
      + cluster_name                = "aws-eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Name" = "aws-eks-cluster"
        }
      + tags_all                    = {
          + "Name" = "aws-eks-cluster"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.28.8-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "aws-eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Name" = "aws-eks-cluster"
        }
      + tags_all                    = {
          + "Name" = "aws-eks-cluster"
        }

      + timeouts {}
    }

  # module.eks.module.eks_managed_node_group["bottlerocket_default"].aws_eks_node_group.this[0] is tainted, so must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_default-20240502195756946700000001/14c79d71-46ca-2968-b10b-f35f6146cfe1" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "aws-eks-cluster:bottlerocket_default-20240502195756946700000001" -> (known after apply)
      ~ instance_types         = [
          - "t3.medium",
        ] -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "bottlerocket_default-20240502195756946700000001" -> (known after apply)
      ~ release_version        = "1.19.5-64049ba8" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-bottlerocket_default-20240502195756946700000001-14c79d71-46ca-2968-b10b-f35f6146cfe1"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Name" = "bottlerocket_default"
        }
        # (7 unchanged attributes hidden)

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["bottlerocket_default"].aws_eks_node_group.this[0] (deposed object ef2c8207) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_eks_node_group" "this" {
      - ami_type               = "BOTTLEROCKET_x86_64" -> null
      - arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_default-20240502181925617500000019/6cc79d44-2d35-79e3-18f6-b39a2e732c2c" -> null
      - capacity_type          = "ON_DEMAND" -> null
      - cluster_name           = "aws-eks-cluster" -> null
      - disk_size              = 20 -> null
      - id                     = "aws-eks-cluster:bottlerocket_default-20240502181925617500000019" -> null
      - instance_types         = [
          - "t3.medium",
        ] -> null
      - labels                 = {} -> null
      - node_group_name        = "bottlerocket_default-20240502181925617500000019" -> null
      - node_group_name_prefix = "bottlerocket_default-" -> null
      - node_role_arn          = "arn:aws:iam::322620855520:role/bottlerocket_default-eks-node-group-20240502180836949300000003" -> null
      - release_version        = "1.19.5-64049ba8" -> null
      - resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-bottlerocket_default-20240502181925617500000019-6cc79d44-2d35-79e3-18f6-b39a2e732c2c"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - status                 = "CREATE_FAILED" -> null
      - subnet_ids             = [
          - "subnet-02a585fda444c72f1",
          - "subnet-034133c5c95a7eba8",
          - "subnet-08677f2678c1bb640",
        ] -> null
      - tags                   = {
          - "Name" = "bottlerocket_default"
        } -> null
      - tags_all               = {
          - "Name" = "bottlerocket_default"
        } -> null
      - version                = "1.28" -> null

      - scaling_config {
          - desired_size = 1 -> null
          - max_size     = 3 -> null
          - min_size     = 1 -> null
        }

      - timeouts {}

      - update_config {
          - max_unavailable            = 0 -> null
          - max_unavailable_percentage = 33 -> null
        }
    }

Plan: 4 to add, 0 to change, 2 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.eks.module.eks_managed_node_group["bottlerocket_default"].aws_eks_node_group.this[0] has changed%0A  ~ resource "aws_eks_node_group" "this" {%0A      + arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_default-20240502195756946700000001/14c79d71-46ca-2968-b10b-f35f6146cfe1"%0A        id                     = "aws-eks-cluster:bottlerocket_default-20240502195756946700000001"%0A      + resources              = [%0A          + {%0A              + autoscaling_groups              = [%0A                  + {%0A                      + name = "eks-bottlerocket_default-20240502195756946700000001-14c79d71-46ca-2968-b10b-f35f6146cfe1"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            },%0A        ]%0A      + status                 = "CREATE_FAILED"%0A        tags                   = {%0A            "Name" = "bottlerocket_default"%0A        }%0A        # (7 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A+/- create replacement and then destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.aws-auth.kubernetes_config_map_v1_data.aws_auth[0] will be created%0A  + resource "kubernetes_config_map_v1_data" "aws_auth" {%0A      + data          = {%0A          + "mapAccounts" = <<-EOT%0A                - "322620855520"%0A            EOT%0A          + "mapRoles"    = jsonencode([])%0A          + "mapUsers"    = <<-EOT%0A                - "groups":%0A                  - "system:masters"%0A                  "userarn": "arn:aws:iam::322620855520:user/caio"%0A                  "username": "caio"%0A                - "groups":%0A                  - "system:masters"%0A                  "userarn": "arn:aws:iam::322620855520:root"%0A                  "username": "root"%0A            EOT%0A        }%0A      + field_manager = "Terraform"%0A      + force         = true%0A      + id            = (known after apply)%0A%0A      + metadata {%0A          + name      = "aws-auth"%0A          + namespace = "kube-system"%0A        }%0A    }%0A%0A  # module.eks.aws_eks_addon.this["coredns"] will be created%0A  + resource "aws_eks_addon" "this" {%0A      + addon_name                  = "coredns"%0A      + addon_version               = "v1.10.1-eksbuild.7"%0A      + arn                         = (known after apply)%0A      + cluster_name                = "aws-eks-cluster"%0A      + configuration_values        = (known after apply)%0A      + created_at                  = (known after apply)%0A      + id                          = (known after apply)%0A      + modified_at                 = (known after apply)%0A      + preserve                    = true%0A      + resolve_conflicts_on_create = "OVERWRITE"%0A      + resolve_conflicts_on_update = "OVERWRITE"%0A      + tags                        = {%0A          + "Name" = "aws-eks-cluster"%0A        }%0A      + tags_all                    = {%0A          + "Name" = "aws-eks-cluster"%0A        }%0A%0A      + timeouts {}%0A    }%0A%0A  # module.eks.aws_eks_addon.this["kube-proxy"] will be created%0A  + resource "aws_eks_addon" "this" {%0A      + addon_name                  = "kube-proxy"%0A      + addon_version               = "v1.28.8-eksbuild.2"%0A      + arn                         = (known after apply)%0A      + cluster_name                = "aws-eks-cluster"%0A      + configuration_values        = (known after apply)%0A      + created_at                  = (known after apply)%0A      + id                          = (known after apply)%0A      + modified_at                 = (known after apply)%0A      + preserve                    = true%0A      + resolve_conflicts_on_create = "OVERWRITE"%0A      + resolve_conflicts_on_update = "OVERWRITE"%0A      + tags                        = {%0A          + "Name" = "aws-eks-cluster"%0A        }%0A      + tags_all                    = {%0A          + "Name" = "aws-eks-cluster"%0A        }%0A%0A      + timeouts {}%0A    }%0A%0A  # module.eks.module.eks_managed_node_group["bottlerocket_default"].aws_eks_node_group.this[0] is tainted, so must be replaced%0A+/- resource "aws_eks_node_group" "this" {%0A      ~ arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_default-20240502195756946700000001/14c79d71-46ca-2968-b10b-f35f6146cfe1" -> (known after apply)%0A      ~ capacity_type          = "ON_DEMAND" -> (known after apply)%0A      ~ disk_size              = 20 -> (known after apply)%0A      ~ id                     = "aws-eks-cluster:bottlerocket_default-20240502195756946700000001" -> (known after apply)%0A      ~ instance_types         = [%0A          - "t3.medium",%0A        ] -> (known after apply)%0A      - labels                 = {} -> null%0A      ~ node_group_name        = "bottlerocket_default-20240502195756946700000001" -> (known after apply)%0A      ~ release_version        = "1.19.5-64049ba8" -> (known after apply)%0A      ~ resources              = [%0A          - {%0A              - autoscaling_groups              = [%0A                  - {%0A                      - name = "eks-bottlerocket_default-20240502195756946700000001-14c79d71-46ca-2968-b10b-f35f6146cfe1"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            },%0A        ] -> (known after apply)%0A      ~ status                 = "CREATE_FAILED" -> (known after apply)%0A        tags                   = {%0A            "Name" = "bottlerocket_default"%0A        }%0A        # (7 unchanged attributes hidden)%0A%0A      ~ update_config {%0A          - max_unavailable            = 0 -> null%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.eks.module.eks_managed_node_group["bottlerocket_default"].aws_eks_node_group.this[0] (deposed object ef2c8207) will be destroyed%0A  # (left over from a partially-failed replacement of this instance)%0A  - resource "aws_eks_node_group" "this" {%0A      - ami_type               = "BOTTLEROCKET_x86_64" -> null%0A      - arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_default-20240502181925617500000019/6cc79d44-2d35-79e3-18f6-b39a2e732c2c" -> null%0A      - capacity_type          = "ON_DEMAND" -> null%0A      - cluster_name           = "aws-eks-cluster" -> null%0A      - disk_size              = 20 -> null%0A      - id                     = "aws-eks-cluster:bottlerocket_default-20240502181925617500000019" -> null%0A      - instance_types         = [%0A          - "t3.medium",%0A        ] -> null%0A      - labels                 = {} -> null%0A      - node_group_name        = "bottlerocket_default-20240502181925617500000019" -> null%0A      - node_group_name_prefix = "bottlerocket_default-" -> null%0A      - node_role_arn          = "arn:aws:iam::322620855520:role/bottlerocket_default-eks-node-group-20240502180836949300000003" -> null%0A      - release_version        = "1.19.5-64049ba8" -> null%0A      - resources              = [%0A          - {%0A              - autoscaling_groups              = [%0A                  - {%0A                      - name = "eks-bottlerocket_default-20240502181925617500000019-6cc79d44-2d35-79e3-18f6-b39a2e732c2c"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            },%0A        ] -> null%0A      - status                 = "CREATE_FAILED" -> null%0A      - subnet_ids             = [%0A          - "subnet-02a585fda444c72f1",%0A          - "subnet-034133c5c95a7eba8",%0A          - "subnet-08677f2678c1bb640",%0A        ] -> null%0A      - tags                   = {%0A          - "Name" = "bottlerocket_default"%0A        } -> null%0A      - tags_all               = {%0A          - "Name" = "bottlerocket_default"%0A        } -> null%0A      - version                = "1.28" -> null%0A%0A      - scaling_config {%0A          - desired_size = 1 -> null%0A          - max_size     = 3 -> null%0A          - min_size     = 1 -> null%0A        }%0A%0A      - timeouts {}%0A%0A      - update_config {%0A          - max_unavailable            = 0 -> null%0A          - max_unavailable_percentage = 33 -> null%0A        }%0A    }%0A%0APlan: 4 to add, 0 to change, 2 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
 

```
</details>
